In [11]:
import pandas as pd
from pandas import DataFrame

In [12]:
average = {}
median ={}
total = {}
all_players = {}
over_mio = {}
for year in range(2007, 2018):
#     print(year)
    data = pd.read_csv("mls-salaries-{0}.csv".format(year))
    df = DataFrame(data, columns=["guaranteed_compensation"])
    df["guaranteed_compensation"] = df["guaranteed_compensation"].fillna(0).astype(int)
    df = df.assign(year=year)
    df = df.reindex_axis(["year","guaranteed_compensation"], axis=1)
    million = df[df["guaranteed_compensation"] >= 1000000].reset_index()
    group_average = df.groupby("year", as_index=False).mean()
    group_median = df.groupby("year", as_index=False).median()
    group_total = df.groupby("year", as_index=False).sum()
    group_all_players = df.groupby("year", as_index=False).count()
    group_over_mio = million.groupby("year", as_index=False).count()
#     print(over_mio)
#     print(group)
    average[year] = group_average.guaranteed_compensation
    median[year] = group_median.guaranteed_compensation
    total[year] = group_total.guaranteed_compensation
    all_players[year] = group_all_players.guaranteed_compensation
    over_mio[year] = group_over_mio.guaranteed_compensation
    
    
    
# print(f)

In [13]:
table = DataFrame.from_dict(average, orient="index").reset_index()

In [14]:
table_median = DataFrame.from_dict(median, orient="index").reset_index()

In [15]:
table_total = DataFrame.from_dict(total, orient="index").reset_index()

In [16]:
table_all = DataFrame.from_dict(all_players, orient="index").reset_index()

In [17]:
table_mio = DataFrame.from_dict(over_mio, orient="index").reset_index()

In [18]:
table_mio

    index   0
0    2007   4
1    2008   4
2    2009   4
3    2010   8
4    2011   9
5    2012  12
6    2013   9
7    2014  15
8    2015  23
9    2016  23
10   2017  28

In [19]:
table = table.rename(columns={'index': 'year', 0:"average"}).round(0).astype(int)
table_median = table_median.rename(columns = {"index":"year", 0:"median"})
table_total = table_total.rename(columns = {"index":"year", 0:"total"})
table_all = table_all.rename(columns = {"index":"year", 0:"num_players"})
table_mio = table_mio.rename(columns = {"index":"year", 0:"num_over_mio"})

In [21]:
table_all

    year  num_players
0   2007          371
1   2008          411
2   2009          388
3   2010          411
4   2011          525
5   2012          554
6   2013          576
7   2014          572
8   2015          574
9   2016          555
10  2017          616

In [9]:
join = (pd.merge(pd.merge(pd.merge(table, table_median, on='year'), table_total, on='year'), table_all, on))

In [10]:
join

    year  average    median      total
0   2007   113810   50400.0   42223650
1   2008   115067   56988.0   47292488
2   2009   133706   76043.5   51878028
3   2010   173491   92375.0   71304949
4   2011   162056   79764.0   85079445
5   2012   179166   84770.5   99257836
6   2013   165066   87333.0   95078091
7   2014   226454   92000.0  129531788
8   2015   291933  112000.0  167569699
9   2016   316777  117000.0  175811371
10  2017   326139  135002.0  200901705

In [11]:
join.to_csv("salaries.csv", index = False)